Tekla Open API Reference for Tekla Structures 2025
ModelViewEnumerator Properties
The ModelViewEnumerator type exposes the following members.
Properties
Name | Description
Count
Returns the number of views in the enumerator.
Current
Returns the current view.
CurrentViewId
 Gets the current view identifier.
Top
See Also
Reference
ModelViewEnumerator Class
Tekla.Structures.Model.UI Namespace